#include "画图形.h"
#include<graphics.h>
#include<stdio.h>
void map(int a[10][10])//将地图初始化，使用数组储存地图信息，0为空白，1为墙壁，2为箱子，3为人，4为目标点
{
	int i,j;
	for ( i = 0; i < 10; i++)
	{
		for (j = 0; j < 10; j++)
		{
			if (a[i][j]==1)
			{
				wall((20 + 40 * j), (20 + 40 * i));
			}
			else if (a[i][j] == 2)
			{
				box((20 + 40 * j), (20 + 40 * i));
			}
			else if (a[i][j] == 3)
			{
				people((20 + 40 * j), (20 + 40 * i));
			}
			else if (a[i][j] == 4)
			{
				ball((20 + 40 * j), (20 + 40 * i));
			}
		}
	}
}

int main()
{
	int a[10][10] = {
		0,0,0,0,0,0,0,0,0,0,
		0,0,0,1,1,1,0,0,0,0,
		0,0,0,1,4,1,0,0,0,0,
		0,0,0,1,2,1,1,1,1,0,
		0,1,1,1,3,0,2,4,1,0,
		0,1,4,2,0,0,1,1,1,0,
		0,1,1,1,1,2,1,0,0,0,
		0,0,0,0,1,4,1,0,0,0,
		0,0,0,0,1,1,1,0,0,0,
		0,0,0,0,0,0,0,0,0,0
	};
	initgraph(640, 500);
	map( a);
	getchar();
	closegraph();

}